<!-- 

Задача №310. Проверка на простоту_0
Проверьте, является ли число простым.

Входные данные
Вводится одно натуральное число n не превышающее 2000000000 и не равное 1.

Выходные данные
Необходимо вывести  строку prime, если число простое, или composite, если число составное.

Примеры
входные данные
5
выходные данные
prime

 -->

<?php

function is_Prime($num){

    if ($num == 2){
        echo "prime";
    } else {
        $j = 0;
        for ($i = $num-1; $i > 1; $i--){
            if ($num % $i == 0) $j++;
        }

        echo ($j > 0) ? "composite" : "prime";
    }
}


is_Prime(readline());

