<!-- 

Задача №3800. Возведение в степень
Дано действительное положительное число a и целое неотрицательное число n. Вычислите a n не используя циклы и стандартную функцию pow, а используя рекуррентное соотношение an=a⋅an−1.

Решение оформите в виде функции power(a, n).

Входные данные
Вводятся действительное положительное число a и целое неотрицательное число n.

Выходные данные
Выведите ответ на задачу.

Примеры
входные данные
2
3
выходные данные
8

 -->

<?php

function power($base,$ex){
    $result = 1;

    if ($ex == 0){
        return $result;
    } else{
        
        for ($i = 1; $i <= $ex; $i++){
            
            $result *= $base;
        }

        return $result;
    }   
}


$a = readline();
$n = readline();

echo(power($a, $n));